Revit 2027 API
IFCGuidKey.IFCGlobalId Property
 IFC GlobalId for map.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string IFCGlobalId { get; }
Public ReadOnly Property IFCGlobalId As String
	Get
public:
property String^ IFCGlobalId {
	String^ get ();
}
member IFCGlobalId : string with get
Property Value
String
See Also
Reference
IFCGuidKey Class
Autodesk.Revit.DB.IFC Namespace